<template>
  <div class="agm__container">
    <div class="agm__section">请仔细阅读本声明，如有任何疑问，请咨询相关法律、财务顾问。</div>
    <div class="agm__section">术语使用是指法律免责声明中构成的Bgain标准条款和服务条款中的术语。</div>
    <div class="agm__section">1.免责声明</div>
    <div class="agm__section">以下免责声明免除并且不影响Bgain服务条款及条款中规定的责任免除：</div>
    <div class="agm__section">
      （a）我司提供的服务以“初始”和“可用”为基准，对界面的可访问性，适用性、准确性所做的保证不做其他明示或暗示的陈述，并拒绝承担任何错误责任。
    </div>
    <div class="agm__section">（b）我司及关联公司员工不以任何形式向任何实体或个人作任何陈述，保证或承诺，包括关于</div>
    <div class="agm__section">（i）服务界面上所载任何信息的准确性和完整性，包括但不限于数字资产价格数据;</div>
    <div class="agm__section">
      （ii）实施涉及控制范围之外的第三方的任何交易所需的时间。为继续向用户提供完整准确信息，我司保持更新信息，恕不另行通知，包括但不限于相关政策，产品和服务的信息。因此，用户应在使用之前验证所有信息，并且基于服务所有决策均由用户自行承担责任，我司对此类决策不承担任何责任。第三方（包括但不限于网站）的链接为用户使用方便提供，不受我司实际控制。用户承认并同意，我司不对任何第三方或链接到本服务界面的第三方站点中包含的信息，内容或服务负责。
    </div>
    <div class="agm__section">
      （c）对于可能影响用户计算机或其他设备的病毒，间谍软件，恐吓软件，木马，蠕虫，恶意软件或任何网络钓鱼恶意软件造成的任何损害或中断，我司不承担任何责任。用户还应注意，SMS、SIM卡、电子邮件容易受到恶意网络攻击，因此请注意确认我司此类邮件。如用户对消息、通知的真实性有疑问，请在服务界面上登录其帐户以查看并确认所需要进行的操作。
    </div>
    <div class="agm__section">（d）用户负责本人所有用户名、登录密码、提示信息、
      API密钥或用于访问服务的其他代码的维护。上述信息任何丢失或损害可能导致未经授权访问，包括用户数字资产丢失或被盗。用户需保持电子邮件地址和电话号码的最新状态，以便接收我司可能发送任何通知或警报。由于我司未发生未能遵守或因采取行动推迟的情况，因用户身份信息遭受的损失，我司不承担任何责任。如存储在我服务平台中的数字资产遭到损失，用户应立即与我司联系。
    </div>
    <div class="agm__section">2.潜在风险</div>
    <div class="agm__section">
      数字资产委托投资具备一定的风险。通过使用服务，用户明确承认并承担本协议中规定的风险。如这些风险发生，则我司服务提供会受到各种不利或重大影响，并且用户的数字资产可能会遭受损失，此类风险包括但不限于以下内容：
    </div>
    <div class="agm__section">（a）市场风险</div>
    <div class="agm__section">
      数字资产市场仍然是具有不确定性的，因此，交易或持有数字资产都具备风险。请仔细考虑个人具体财务状况再决定是否使用。我司及其关联公司对用户服务相关的损失不承担任何责任。
    </div>
    <div class="agm__section">（b）流动性风险</div>
    <div class="agm__section">
      数字资产不是由任何中央银行或国家、政府机构、组织发行的，数字资产也存在没有任何固定资产或其他信用支持的情况，我司不对服务界面上任何数字资产的流通负责。数字资产的价值仅取决于相关市场参与者之间对其价值的共识，并且没有人有义务保证可以在任何时间、任何程度在界面上的任何数字资产的流动性或市场价格。数字资产的市场可能会突然出现和消失，因此我司及关联公司不对服务界面上交易的任何数字资产的未来市场价格作任何陈述或保证。任何数字资产可能的退市，恕不征得用户方同意。
    </div>
    <div class="agm__section">（c）交易风险</div>
    <div class="agm__section">
      除了流动性风险之外，任何加密货币市场的价值都是不稳定的，并且可能会迅速发生变化。用户应密切关注其受到的交易或因其他市场活动带来的不利影响。
    </div>
    <div class="agm__section">（d）我司及其关联公司可能会遇到系统故障，网络或服务中断，硬件软件缺陷，安全漏洞等。</div>
    <div class="agm__section">（i）我司无法预测黑客攻击，网络攻击，采矿攻击（包括但不限于双重攻击，多数采矿权攻击和“自私采矿”攻击）
      ），服务错误，界面中的漏洞或缺陷的发生。如，编程中的缺陷或导致源代码被利用或滥用，我司可能无法及时发现此类问题，并且可能出现没有足够的资源来有效地应对同时或快速连续发生的多个事件。
    </div>
    <div class="agm__section">（ii）尽管采取措施防止恶意攻击，但仍无法保证网络攻击，我司对服务平台中存储的界面和用户数字资产的稳定性和安全性不提供任何保证。</div>
    <div class="agm__section">（f）由于交易数字资产界面，用户可能会受到不利的税务影响</div>
    <div class="agm__section">
      （i）数字货币和数字资产的法律特征仍旧不确定，数字资产可能被视为某些司法管辖区的合法证券，我司对任何数字资产的分类不提供任何担保，用户将承担数字资产在其各自管辖范围内的所有后果，并承担相应的法律责任。
    </div>
    <div class="agm__section">
      （ii）此外，对数字货币资产的获取或税务处理可能取决于它们是否被定义分类为证券，资产，货币等。由于数字资产税务特征的不确定性，用户必须就数字资产管理服务寻求税务建议，并考虑可能会对用户造成不利的税务后果。
    </div>
    <div class="agm__section">（g）数字资产的监管制度的不明朗，任何变更，法规或政策都可能会对我司提供服务或数字资产价值产生不利影响。</div>
    <div class="agm__section">（i）加密货币和加密货币交易所的监管目前尚未完善，此类监管在各司法管辖区之间也存在显着差异，因此存在重大不确定性。各国立法和执行机构在未来可能会通过法律，法规，指导其行动，这可能严重影响我司所提供服务。对于用户未能遵守相关法律法规，其中对用户造成各种不利后果，包括民事处罚和罚款，我司不负任何责任。</div>
    <div class="agm__section">（ii）目前持续性更新的法律法规对数字资产的价值，流动性及用户访问界面可能产生不利影响。</div>
    <div class="agm__section">（iii）如我司在任何管辖区内获得许可，（统称为“监管批准”）以提供服务，但无法获得此类监管批准或相关机构因任何原因的监管批准，则该管辖区内的用户无法访问服务。</div>
    <div class="agm__section">（iv）此外，政府或监管机构如何影响加密货币贸易的法律和法规实施任何变更很难预测，如遵守此类法规的成本超过某个阈值，则服务的提供在相关司法管辖区可能不再具有商业可行性，并且我司可选择停止向用户提供服务。</div>
    <div class="agm__section">（h）可能存在与自然灾害，战争，恐怖袭击，骚乱，传染病以及我司无法控制的有关风险。</div>
    <div class="agm__section">由于自然灾害，战争，恐怖袭击，骚乱，传染病以及我司无法控制的其他事件，服务可能会中断，暂停或延迟。此类事件还可能导致全球市场经济前景的不确定，并且无法保证包括服务界面在内的数字货币资产管理服务不会受到影响。在此类事件中，市场价格以及服务界面上数字资产和货币的需求也可能受到重大影响。</div>
    <div class="agm__section">数字货币是一种相对较新的动态技术。除了此处强调的风险之外，还存在与服务界面交易相关的其他风险，包括我司无法预期的风险。</div>
    <div class="agm__section">3.其他</div>
    <div class="agm__section">我司不会就交易技术，模型，算法提供任何投资建议。关于服务的任何信息都不应被视为相关交易的商业，法律，财务建议。在使用服务之前，用户应咨询相关顾问。</div>
  </div>
</template>

<script>
export default {
  name: 'Disclaimer',
};
</script>
