<template>
  <div class="agm__container">
    <div class="agm__section">本协议由以下各方订立：</div>
    <div class="agm__section">委托方：</div>
    <div class="agm__section">代理方：Bgain</div>
    <div class="agm__section">委托方与代理方单独称为“一方”，合称“双方”。</div>
    <div class="agm__section">本协议由双方当事人于2019年 月 日签署于【*】。</div>
    <div class="agm__section">鉴于：</div>
    <div class="agm__section">委托方有意委托代理方，由代理方为委托方就其所有数字资产寻找及选择适合的第三方资产管理服务提供商，并由代理方作为委托方的代理与该等服务提供上签署相关协议。</div>
    <div class="agm__section">代理方愿意接受委托方的上述代理委托。</div>
    <div class="agm__section">为明确双方关于上述代理的权利、义务及职责，保护双方的合法权益，双方本着自愿、有偿、诚信的原则，经平等友好协商一致，签署本《委托代理协议》（“本协议”）。</div>
    <div class="agm__section"></div>
    <div class="agm__section">第一章 释义</div>
    <div class="agm__section">1.1 除另有规定外，本协议中下列词语的定义如下：</div>
    <div class="agm__section">（1）
      关联方：针对任何特定人士而言，指直接或间接通过一个或一个以上中介控制该特定人士、被该特定人士所控制或与该特定人士受共同控制的人士；以及，就自然人而言，还包括该人士的配偶、配偶的父母及直系后辈亲属和前辈亲属。为本协议之目的，“控制”包括但不限于股权控制、通过合同关系（包括但不限于一致行动协议或类似约定）的控制、通过管理关系的控制及任何实际控制；
    </div>
    <div class="agm__section">（2） 有权机关：指有管辖权的任何政府或其隶属机构，任何政府或其隶属机构的部门、机关或机构，任何法院或仲裁庭；</div>
    <div class="agm__section">（3） 身份证明文件：包括身份证、护照、营业执照、公司登记证书等其他代理方接受的可证明自然人或机构身份的法定证明文件；</div>
    <div class="agm__section">（4） 法律法规：指应适用的法律、行政法规、部门规章及规范性文件以及对该等法律法规不时的修订和补充。</div>
    <div class="agm__section"></div>
    <div class="agm__section">第二章 代理</div>
    <div class="agm__section">2.1代理内容</div>
    <div class="agm__section">（1）委托方在此委任代理方，在代理服务期限内，代理委托方为委托方【指定的】数字资产（“代理资产”）寻找及选择适合的资产管理服务提供商（“资产管理公司”）；</div>
    <div class="agm__section">（2）委托方在此委任代理方，在代理服务期限内，代理委托人（以代理人自己名义或以委托人代理人名义，包括隐名和显名代理）聘用资产管理公司对代理资产进行资产管理。</div>
    <div class="agm__section">代理人在此接受上述代理委托。</div>
    <div class="agm__section">2.2 代理权限</div>
    <div class="agm__section">
      除了委托方事先书面明示反对的情形外，代理方有权为了委托方的利益，依其独立判断寻找及选择任何其认为适合的资产管理公司，并代理委托人聘用资产管理公司对代理资产的部分或全部进行资产管理，填写、签署及递交任何与上述资产管理相关协议、文件和工具（统称“资产管理文件”）。
    </div>
    <div class="agm__section">委托方在此确认和同意，代理方根据本协议代理委托方签署的资产管理文件，均由其享有全部权利和收益，并承担全部义务和风险（包括但不限于商业和法律上的风险）。</div>
    <div class="agm__section">
      【委托方委托代理方保管全部的资产管理文件。委托方有权随时查阅代理方保管的资产管理文件。另外，在签署资产管理文件中的与资产管理公司之间的资产管理协议（“资产管理协议”）时，代理人应当主动告知委托方资产管理协议的内容，对于超越行业同类的风险和非常规条款应当提请委托方注意。】
    </div>
    <div class="agm__section">【本交易结构是委托方不向代理方交付数字资产的模式，收费在签订资产管理协议时。如有该等交付，可以添加资产交付的条款。】</div>
    <div class="agm__section">【2.3 费用收取</div>
    <div class="agm__section">委托方确知并同意，受托方有权向委托方收取服务费。各项服务费用包括但不限于：</div>
    <div class="agm__section">（1）申购费。委托方订购数字货币委托投资服务需要支付申购费。</div>
    <div class="agm__section">（2）管理费。委托方委托受托方进行投资服务需要支付管理费；</div>
    <div class="agm__section">上述手续费的收取和支付方式按受托方有关规则或委托方签署的相关协议执行，受托方保留单方面制定及调整服务费用的权利。</div>
    <div class="agm__section"></div>
    <div class="agm__section">2.4 费用变更</div>
    <div class="agm__section">受托方可能会对部分免费服务开始收费。前述修改、变更或开始收费前，受托方将在相应服务页面进行通知或公告。如果委托方不同意上述修改、变更或付费内容，则应停止使用该服务。2.5
      代理期限
    </div>
    <div class="agm__section">除了依据法本协议约定提前终止或解除的情形外，委托方委托代理方代理的期限为一（1）年，从 年 月 日起到 年 月
      日止。【除非在代理期限结束前【30】天，委托人书面明示代理期限不再延长，本协议项下代理期限可以自动多次延长，每次延长一年。】
    </div>
    <div class="agm__section">2.6 代理方暂停和终止代理</div>
    <div class="agm__section">即使有任何其他的约定，代理方都有权在下列情况下立即暂停或终止代理委托方，并对该等暂停或终止不承担任何责任：</div>
    <div class="agm__section">（1）委托方委托代理方代理的事项，依代理方的合理判断，违反了法律法规；</div>
    <div class="agm__section">（2）根据相关法律法规或有权机关的要求；</div>
    <div class="agm__section">（3）依代理方的合理判断，代理资产来源非法的；</div>
    <div class="agm__section">（4）委托方拖欠代理服务费的；或</div>
    <div class="agm__section">（5）根据本协议的其他约定。</div>
    <div class="agm__section">2.7 委托人材料</div>
    <div class="agm__section">（1）委托方应提供代理方不时要求的合法、真实、有效及完整的信息及资料，包括但不限于如下的信息及资料：</div>
    <div class="agm__section">a.
      若委托方为自然人用户，委托方的姓名、国籍、常住地址、联系方式、出生日期、身份证明文件的号码、身份证件（正反面）或护照（照片信息页和签字页）、委托人手持对应身份证明证件的照片或其他身份证明文件的复印件以及其根据代理方要求拍摄的照片等；
    </div>
    <div class="agm__section">b. 若委托方为机构用户，委托方的机构名称、注册地址、联系方式、营业执照或公司登记证明的复印件，法定代表人的身份证明文件、联系方式、董事及高管登记名册等。</div>
    <div class="agm__section">
      （2）代理方有权依据其自身独立判断，发现上述信息及资料有任何错误、虚假、失效、过期或不完整的，或者代理方有合理的理由怀疑信息或资料错误、虚假、失效、过期或不完整，代理方有权要求委托方进一步提供，也有权直接拒绝提供、暂停、中止或者终止代理。如代理方要求委托方进一步提供相关信息及资料而委托方拒绝或补充提供后仍存在上述情形的，代理方有权暂停或者终止代理，由此产生的一切责任均由委托方自行承担。
    </div>
    <div class="agm__section">（3）若委托方未及时更新上述信息或材料导致代理方在代理委托方时无法使用上述信息或材料或者发生错误的，代理方不承担任何责任。</div>
    <div class="agm__section">（4）代理人有权向资产管理公司提交委托方向其提交的信息和资料里的部分或全部。</div>
    <div class="agm__section">2.8 委托方承诺，其将不干涉代理方就寻找、选择及聘用资产管理公司的独立判断（双方另有书面约定的除外），并将为代理方提供其要求的和必要的协助，配合代理方进行本协议项下的代理。
    </div>
    <div class="agm__section">2.9
      委托方承诺，在因本协议及本协议项下代理引起或与之有关的任何要求、诉因、诉讼、索赔、及其他程序（无论是与资产管理公司之间，与任何其他人之间或其他情况）中，其将全力为代理方、其关联方或该等人士的董事、管理人员、雇员、代理或代表（统称“被保护人士”）进行辩护和支持。任何被保护人士如有任何因本协议及本协议项下代理引起或与之有关的损失、责任、罚款、成本或费用（包括调查费用，辩护和律师费，委托方都将全额赔偿，以使被保护人士免受任何损害。本第2.9条约定在本协议因任何原因撤销、终止或到期后继续有效。
    </div>
    <div class="agm__section"></div>
    <div class="agm__section">第三章声明和保证</div>
    <div class="agm__section">3.1委托方的声明和保证：</div>
    <div class="agm__section">（1）委托方是依据所在地法律合法设立并有效存续的实体；或依照其所属、所居住地法律为完全行为能力的自然人；</div>
    <div class="agm__section">（2） 委托方订立并履行本协议不违反委托方所属、所居住或者开展经营活动或其他业务的国家和地区的法律法规或其组织性文件（如适用）；</div>
    <div class="agm__section">（3）委托方自愿且拥有完全的权力和授权签署、履行本协议。其已经就本协议的签署得到合法有效的授权（如需）。本协议一经签署，即对其构成合法、有效且有约束力的义务；</div>
    <div class="agm__section">（4）委托方承诺其并非任何政府、国际组织等发布的制裁名单中的人员；</div>
    <div class="agm__section">（5）委托方在此保证提供给代理方的所有与本协议有关的资料和信息是完整、真实、准确、合法的，没有重大遗漏或误导性陈述；</div>
    <div class="agm__section">（6）委托方保证代理资产来源的合法性；</div>
    <div class="agm__section">（7）委托方已认真阅读并完全接受本协议（包括各附件），并对代理资产委托资产管理公司进行资产管理的风险有充分的了解；</div>
    <div class="agm__section">（8）委托方承诺因适用法律或情况发生变化而致使上述声明和承诺不再正确、完整、有效，则其将立即以书面形式通知代理方。</div>
    <div class="agm__section">3.2 若委托方违反前述声明与承诺，代理方有权暂停或停止代理委托方。</div>
    <div class="agm__section">3.3 代理方的声明和保证：</div>
    <div class="agm__section">（1）代理方是依据所在地法律合法设立并有效存续的实体；</div>
    <div class="agm__section">（2）代理方订立并履行本协议不违反委托方所属、所居住或者开展经营活动或其他业务的国家和地区的法律法规或其组织性文件（如适用）；</div>
    <div class="agm__section">（3）代理方自愿且拥有完全的权力和授权签署、履行本协议。其已经就本协议的签署得到合法有效的授权（如需）。本协议一经签署，即对其构成合法、有效且有约束力的义务；</div>
    <div class="agm__section"></div>
    <div class="agm__section">第四章 协议提前终止</div>
    <div class="agm__section">4.1 在代理期限内，若发生以下情况，本协议自动提前终止：</div>
    <div class="agm__section">（1） 委托方（机构）解散、依法被撤销、破产，或委托方（自然人）不再是其所属、所居住地法律项下具有完全行为能力的自然人</div>
    <div class="agm__section">（2） 代理方解散、依法被撤销、破产；</div>
    <div class="agm__section">（3） 本协议被有权机关认定违反法律法规或被有权机关要求终止；或</div>
    <div class="agm__section">（4） 双方协商一致终止本协议的。</div>
    <div class="agm__section">双方同意，截至该等协议终止日代理方已经收取的代理费及委托方应当支付的代理费和其他费用不受该等协议终止的影响，委托方仍应按照本协议约定支付。</div>
    <div class="agm__section"></div>
    <div class="agm__section">第五章 风险承担和责任限制</div>
    <div class="agm__section">5.1 委托方认识并接受由于数字资产的特殊性所代来的各种风险，包括但不限于附件二中列明的各种风险。委托方清楚了解并完全承担该等风险，代理方不需就该等风险对委托方承担任何责任。
    </div>
    <div class="agm__section">
      5.2委托方确认并同意，代理方不就资产管理公司的资产管理（包括但不限于代理资产的任何损失）及任何其他的行为或不行为（包括但不限于资产管理公司不遵守任何资产管理文件或相关法律法规的任何行为和不行为）承担任何责任，。
    </div>
    <div class="agm__section">5.3 在任何情况下，代理方对委托方由于本协议、本协议项下代理或与之相关的赔偿总额不得超过本协议项下代理方实际从委托方处取得的代理费（以代理费的原币种计算）。</div>
    <div class="agm__section"></div>
    <div class="agm__section">第六章 送达与通知</div>
    <div class="agm__section"></div>
    <div class="agm__section">6.1
      一方向另一方发出的任何通知、要求、需要、主张和其他联络内容等应以官网通知、站内信、当面递交、传真、快递、挂号信、电子邮件或短信中的一种或多种方式送至本协议双方指定的联系人及其联系信息见附件一。
    </div>
    <div class="agm__section">
      6.2一方在任何时间改变接收通知所用的地址、电子邮箱、传真号码或手机号码都应立即将该变更书面通知另一方；如果该变更通知未能送达，递交给上述收件人或地址的，通知或联络应视为被正常发送和接收。
    </div>
    <div class="agm__section">6.3
      除本协议另有约定外，所有该等通知和联络均应视为已被收到：（1）当面递交的，于递交时收到；（2）邮寄或快递的，则寄出五个工作日视为收到；（3）传真递交的，传真机报告确认时视为收到；（4）电子邮件发送的，收件方服务器接收视为收到；（5）短信发送的，发送方发送成功视为收到。
    </div>
    <div class="agm__section"></div>
    <div class="agm__section">第七章 保密义务</div>
    <div class="agm__section">7.1
      双方承诺，未经另一方事先同意，不向任何第三方披露本协议的内容及其存在本身以及在履行本协议过程中所获取的任何信息，但是（1）代理人向资产管理公司披露（但资产管理公司应书面承诺承担同等保密义务），（2）向专业顾披露（但该等专业顾问应书面承诺承担同等保密义务），或（2）根据适用法律、或有管辖权的有权机关的询问或调查而披露的除外。本第7.1条约定在本协议因任何原因撤销、终止或到期后继续有效。
    </div>
    <div class="agm__section"></div>
    <div class="agm__section">第八章 法律适用和争议解决</div>
    <div class="agm__section">8.1本协议适用开曼群岛法律法规，并按其解释。</div>
    <div class="agm__section">
      8.2双方同意，因本协议而产生的或与本协议有关的一切争议，双方应尽量通过协商解决。经友好协商未能解决的，应提交新加坡国际仲裁中心依当时有效的仲裁规则申请仲裁，仲裁地在新加坡，仲裁裁决是终局性的，对双方具有约束力，除裁决另有规定外，仲裁费由败诉方承担。
    </div>
    <div class="agm__section">8.3
      双方同意，因本协议而产生的或与本协议有关的一切争议，不得通过集体仲裁、集体诉讼或其他任何类型的代表诉讼来解决。在法律允许的最大范围内，委托方不可撤销、无条件地放弃提起或参与任何针对代理方、其关联方或任何被保护人士的集体诉讼、集体仲裁的权利。
    </div>
    <div class="agm__section">8.4
      在法律允许的最大范围内，委托方不可撤销、无条件地放弃对其自身及其任何收入或资产基于所有权或其他类似理由对下列事项的所有豁免：（1）诉讼或仲裁；（2）任何法院或仲裁庭的管辖权；（3）通过强制令或命令对其自身及其任何收入或资产的救济；（4）资产扣押；（5）执行任何司法管辖区的法院的任何诉讼中获得的任何判决或仲裁庭仲裁获得的任何裁决。
    </div>
    <div class="agm__section">8.6本第8条约定在本协议因任何原因撤销、终止或到期后继续有效。</div>
    <div class="agm__section"></div>
    <div class="agm__section">第九章 其他</div>
    <div class="agm__section">
      9.1本协议的任何条款或其部分在任何法律项下被认定为非法、无效或不可执行，均不影响，该条款其他部分和本协议其他条款在该等法律项下的效力和执行，及该等条款或部分条款在其他任何法律项下的效力和执行。
    </div>
    <div class="agm__section">9.5本协议正本一式贰份，委托方、代理方各持有壹份，每份具有同等法律效力。</div>
    <div class="agm__section">9.6本协议自委托方有权签署人签字并加盖公章（如适用）和代理方有权签署人签字并加盖公章（如适用）之日起生效。</div>
    <div class="agm__section">委托方：</div>
    <div class="agm__section">有权签署人：_________________</div>
    <div class="agm__section">公司公章（如适用）：</div>
    <div class="agm__section">日期： 年 月 日</div>
    <div class="agm__section">代理方：</div>
    <div class="agm__section">有权签署人：_________________</div>
    <div class="agm__section">公司公章（如适用）：</div>
    <div class="agm__section">日期： 年 月 日</div>
    <div class="agm__section">附件一：双方对接人</div>
    <div class="agm__section">1、 委托方</div>
    <table style="width: 100%">
      <tbody>
      <tr>
        <td><strong>职责</strong></td>
        <td>&nbsp;</td>
        <td>&nbsp;</td>
      </tr>
      <tr>
        <td rowspan="3">联系人</td>
        <td>姓名：</td>
        <td>身份证号：</td>
      </tr>
      <tr>
        <td>传真:</td>
        <td>电话：</td>
      </tr>
      <tr>
        <td>手机:</td>
        <td>电子邮件:</td>
      </tr>
      <tr>
        <td rowspan="3">合同签约人</td>
        <td>姓名：</td>
        <td>身份证号：</td>
      </tr>
      <tr>
        <td>传真:</td>
        <td>电话：</td>
      </tr>
      <tr>
        <td>手机:</td>
        <td>电子邮件:</td>
      </tr>
      </tbody>
    </table>
    <div class="agm__section">2、代理方</div>
    <table style="width: 100%">
      <tbody>
      <tr>
        <td><strong>职责</strong></td>
        <td>&nbsp;</td>
        <td>&nbsp;</td>
      </tr>
      <tr>
        <td rowspan="3">联系人</td>
        <td>姓名：</td>
        <td>身份证号：</td>
      </tr>
      <tr>
        <td>传真:</td>
        <td>电话：</td>
      </tr>
      <tr>
        <td>手机:</td>
        <td>电子邮件:</td>
      </tr>
      <tr>
        <td rowspan="3">合同签约人</td>
        <td>姓名：</td>
        <td>身份证号：</td>
      </tr>
      <tr>
        <td>传真:</td>
        <td>电话：</td>
      </tr>
      <tr>
        <td>手机:</td>
        <td>电子邮件:</td>
      </tr>
      </tbody>
    </table>
    <div class="agm__section">附件二：《风险提示书》</div>
    <div class="agm__section">1、 与区块链有关的风险</div>
    <div class="agm__section">由于代理资产系基于区块链技术，相关区块链的任何故障、崩溃均可能对代理资产的价值、安全、可交易等产生重大不利影响。</div>
    <div class="agm__section">2、 由于丢失私钥导致丢失代理资产的风险</div>
    <div class="agm__section">由于私钥是控制和处置存储在数字钱包或其他类似存储机制中的代理资产所必需的。因此，丢失与存储代理资产的钱包或其他类似存储机制相关联的私钥，可能导致代理资产的丢失。</div>
    <div class="agm__section">3、 黑客攻击的风险</div>
    <div class="agm__section">黑客或其他恶意团体或组织可能试图以各种方式攻击并盗取数字资产，包括但不限于恶意软件攻击等，委托方的代理资产可能遭受黑客攻击，并导致委托方被盗取代理资产。</div>
    <div class="agm__section">4、 与尚不明确的法律法规有关的风险</div>
    <div class="agm__section">
      目前，在许多司法管辖区，对区块链、数字资产进行监管的法律法规还尚不明确和不稳定，也很难预测到有权机关是否会颁布涉及上述领域的法律法规及法律法规的内容。有权机关可能对区块链、数字资产等相关领域颁布禁止性或限制性规定。若有权机关认为或法律法规规定为区块链、数字资产提供服务是非法的，则代理方随时可停止提供代理服务。
    </div>
    <div class="agm__section">5、 税收风险</div>
    <div class="agm__section">涉及数字资产的税务事项存在不确定性。代理方为委托方提供涉及数字资产的代理服务可能涉及税务责任，该等税务责任应由委托方承担。</div>
    <div class="agm__section">6、 代理方及其关联方解散的风险</div>
    <div class="agm__section">由于多种原因，包括但不限于商业经营的失败，代理方或其关联方可能会解散。</div>
    <div class="agm__section">7、 与互联网有关的风险</div>
    <div class="agm__section">
      数字资产的存在严重依赖于互联网，然而，互联网的公共性意味着互联网的任何部分或全部在任何时间都可能是不可靠的。此外，资产管理公司通过互联网管理代理资产，可能会出现数据中断、延迟、损坏或丢失、数据传输中保密性的丢失等情形，从而造成代理资产损失。代理方对该等损失不承担任何责任。
    </div>
    <div class="agm__section">8、 与特定司法管辖区有关的风险</div>
    <div class="agm__section">
      与某些限制或禁止数字资产的司法管辖区（“特定司法管辖区”）有相关联系的人员（包括但不限于居民、税务居民）不得委托代理方。一个人居住地或适用法律的改变可能导致该人违反对其享有管辖权的任何法律法规或监管要求。即使住所地或适用法律发生改变，委托方均应确保在代理期限内保证其不是与特定司法管辖区有相关联系的人员。
    </div>
    <div class="agm__section">9、 不可预测的风险</div>
    <div class="agm__section">数字资产系基于一种新型的和未经测试的新技术，由此可能产生除上述风险以外的其他无法预测的风险。</div>

  </div>
</template>

<script>
export default {
  name: 'Investment',
};
</script>

<style scoped>

</style>
