<template>
  <div class="agm__container">
    <div class="agm__section">本隐私权政策自2019年8月1日起生效。</div>
    <div class="agm__section">
      本隐私政策中提及的“Bgain”含Bgain数字资产委托管理服务提供商及其关联公司，负责处理用户的个人数据。我们尊重用户隐私，并致力于保护用户个人数据。用户访问我们的网站www.Bgain.com（无论何处端口），本隐私政策将告知用户正在使用我平台服务。Bgain遵守通用数据保护法规（EU）2016/679（“GDPR”）及相关法律。隐私政策规定了Bgain收集，留存，转移和处理您的个人数据的基本原则。
    </div>
    <div class="agm__section">本隐私政策中包涵的术语具有GDPR中所赋的含义。</div>
    <div class="agm__section">
      访问使用我们的服务即表示用户接受本隐私政策的条款。我司保留随时修订本隐私政策的权利，以适应相关法律或我们的个人数据收集和使用惯例的变化。如本隐私政策有更新，我司将通过电子邮件服务界面告知用户接受更新，才能继续使用服务。如不同意本隐私政策的部分或全部，请立即停止访问或使用我们的界面和服务。
    </div>
    <div class="agm__section">本隐私政策旨在向用户提供有关如何收集和处理用户个人数据的信息。收集处理您的个人数据时，请务必阅读本隐私政策以便您充分了解我们使用您个人数据的方式和原因。</div>
    <div class="agm__section">通知</div>
    <div class="agm__section">用户就确保我们掌握的用户个人数据是准确及最新的。如个人数据在使用中有任何变化，请随时通知我们。</div>
    <div class="agm__section">关于第三方链接</div>
    <div class="agm__section">我们的界面和服务可能包含第三方网站，插件及应用程序链接。点击链接可能允许第三方收集或共享您的数据。特别告知：这些第三方网站不受我司控制，我司也不对其隐私声明负责。
      若用户使用第三方平台，我们建议您仔细阅读所访问网站的隐私政策。
    </div>
    <div class="agm__section">关于数据收集</div>
    <div class="agm__section">个人数据是指可以识别该用户的任何信息。不包括已删除的匿名数据，我们会收集，使用，存储和传输个人数据，如下所示：</div>
    <div class="agm__section">•身份数据包括名字，姓氏，用户名，职称，出生日期，年龄，国籍，照片，性别等身份证详细信息。</div>
    <div class="agm__section">•联系方式数据包括地址，电子邮件地址和电话号码。</div>
    <div class="agm__section">•财务数据包括交易历史，交易数据或税务识别。</div>
    <div class="agm__section">•交易数据包括有关用户从我们这里购买服务的详细信息。</div>
    <div class="agm__section">•技术数据包括：访问网络协议（IP）地址，登录数据，浏览器类型和版本，时区和位置，浏览器插件类型和版本，操作系统和平台以及其他技术接口和服务。</div>
    <div class="agm__section">•个人资料包括用户名和密码，购买或订单，偏好，和调查回馈。</div>
    <div class="agm__section">•使用数据包括提供给我平台的身份验证数据，验证安全问题，用户ID，点击流数据以及通过Cookie收集的其他数据。</div>
    <div class="agm__section">•营销和沟通数据包括用户接收我们和我第三方营销及沟通偏好。</div>
    <div class="agm__section">”汇总数据“ 的收集，使用和共享，来自用户个人数据，但不会被视为法律中的个人数据，这些数据不会直接或间接泄露用户身份。
      如，我们会通过用户的使用数据计算访问网站的用户百分比。如我们使用汇总数据功能将会合并您的个人信息以便身份识别，此类合并数据我们均视为本隐私政策中的一部分。
    </div>
    <div class="agm__section">我们不会收集任何特殊类别的个人数据（包括您的种族或民族，宗教或哲学信仰，健康资料以及遗传和生物识别数据等）。</div>
    <div class="agm__section">数据未提供</div>
    <div class="agm__section">根据签订条款，如用户未能在必要时提供该数据，我们可能无法履行合同为您提供服务。在这种情况下，我们会通知用户方并取消提供产品服务。</div>
    <div class="agm__section">有关数据如何收集</div>
    <div class="agm__section">通常我们收集数据会通过：直接互动；用户通过表格信息填写，电话，电子邮件向我们提供您的身份信息，联系方式等。这包括在以下情况用户向我平台提供个人数据：</div>
    <div class="agm__section">•服务提供申请;</div>
    <div class="agm__section">•在我司服务界面或端口创建了一个帐户;</div>
    <div class="agm__section">•订阅我司服务或关注我司媒体官方平台;</div>
    <div class="agm__section">•向我司发出营销材料或内容发送需求;</div>
    <div class="agm__section">•参加我司项目比赛，推广或调查;</div>
    <div class="agm__section">•向我们提供反馈或主动联系我们。</div>
    <div class="agm__section">交互及第三方来源</div>
    <div class="agm__section">用户在界面交互时信息自动收集（例如浏览操作，模式，硬件模型，设备ID，操作系统版本，Web浏览器软件和IP地址/
      MAC地址/设备标识等）。在相关法规许可范围内，（例如公共数据库，信用中心，ID验证合作，渠道合作，联合营销合作和社交媒体平台等）我司将从各第三方及公共来源接收用户个人信息数据。
    </div>
    <div class="agm__section">使用目的</div>
    <div class="agm__section">我们将仅在法律允许的范围内使用用户的个人数据。因此，参考GDPR中列出的基础法规条款，使用范围包括以下情况：</div>
    <div class="agm__section">•履行即将签订或已与用户签订的合同;</div>
    <div class="agm__section">•用户的利益和基本权益（或第三方利益）不会超出双方的合法权益的范围；</div>
    <div class="agm__section">•遵守所有相关的法律法规。</div>
    <div class="agm__section">详情请参阅以下词汇信息表，了解有关我司处理个人数据的合法依据。</div>
    <div class="agm__section">我们在下面以表格形式列出了详细的个人数据使用说明。</div>
    <table>
      <thead>
      <tr>
        <th>目标</th>
        <th>个人信息类型</th>
        <th>信息处理合法依据</th>
      </tr>
      </thead>
      <tbody>
      <tr>
        <td>注册成为新用户</td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 财务信息 (d) 个人资料 (e)
          营销及沟通
        </td>
        <td>(a) 与用户间签订合同</td>
      </tr>
      <tr>
        <td>
          服务描述： (a) 管理交易，支付信息 (b) 收集及赎回我司所需费用
        </td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 账务信息 (d) 交易信息 (e)
          使用详情 (f) 营销及沟通
        </td>
        <td>(a) 签订合同 (b) 我司合法利益范围内</td>
      </tr>
      <tr>
        <td>
          双方共识: (a) 有关本隐私政策条款的更改通知 (b)
          用户评论及调查请求
        </td>
        <td>(a) 身份信息 (b) 联系方式 (c) 个人资料 (d) 营销及沟通</td>
        <td>
          (a) 签订合同 (b)
          合法权益范围内（保持更新，及用户使用数据研究）
        </td>
      </tr>
      <tr>
        <td>抽奖，比赛或调查邀请</td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 个人资料 (d) 使用详情 (e)
          营销及沟通
        </td>
        <td>
          (a) 签订合同 (b)
          合法权益范围内（用户使用习惯收集以便提升用户体验满意度）
        </td>
      </tr>
      <tr>
        <td>
          服务界面管理及保护（包括故障排除，数据分析，测试，系统维护，支持，报告、数据托管等）
        </td>
        <td>(a) 身份信息 (b) 联系方式 (c) 技术信息 (d) 使用详情</td>
        <td>
          (a) 合同签订
          (b)合法利益范围内（业务运营，服务提供，网络安全，防止欺诈等）
        </td>
      </tr>
      <tr>
        <td>界面服务相关的内容和广告提供，广告提供有效性调查</td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 个人资料 (d) 使用详情 (e)
          营销及沟通 (f) 技术信息
        </td>
        <td>
          (a)
          合法权益范围内（用户使用习惯收集，用户有关营销策略反馈信息）
        </td>
      </tr>
      <tr>
        <td>
          通过使用数据分析改善服务界面，营销活动，客户关系及客户体验
        </td>
        <td>(a) 技术信息 (b) 个人资料 (c) 使用详情</td>
        <td>
          （a）合法权益范围内（用户类型定位网站更新，用户营销策略回馈）
        </td>
      </tr>
      <tr>
        <td>
          为遵守反洗钱和恐怖主义融资法等相关法律，用户身份识别、核实
        </td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 个人资料 (d) 使用详情 (e)
          账务信息 (f) 交易信息
        </td>
        <td>（a）签订合同</td>
      </tr>
      <tr>
        <td>为用户提供服务建议、兴趣建议</td>
        <td>
          (a) 身份信息 (b) 联系方式 (c) 技术信息 (d) 使用详情 (e)
          个人资料 (f) 营销及沟通
        </td>
        <td>
          (a)合法权益范围内（用户使用习惯收集以便提升用户体验满意度）
        </td>
      </tr>
      </tbody>
    </table>
    <div class="agm__section">市场营销</div>
    <div class="agm__section">根据用户可能感兴趣内容，我司将推送活动营销信息，以告知用户活动详情信息，并根据您的偏好提供活动促销优惠等有针对性的活动。</div>
    <div class="agm__section">第三方信息共享</div>
    <div class="agm__section">系统将会定期发出请求，允许系统与第三方共享用户个人数据。合作的第三方我司将会核实其信息使用的合法性，具体如以下情况：</div>
    <div class="agm__section">•与第三方身份验证服务共享用户个人数据信息，以履行“反洗钱法”，“反贿赂法”，“制裁法”，“反恐怖融资法”及相关法律规定的义务;</div>
    <div class="agm__section">•与服务提供商共享个人数据：提供商将根据协议提供咨询、法律、保险服务;</div>
    <div class="agm__section">•与计划合并、收购的公司或其他实体共享个人数据。如有此情况发生，我司将要求其共同遵守本隐私政策。任何政策发生变化时用户将收到平台通知;</div>
    <div class="agm__section">•任何法律程序强制要求时，或必须披露个人数据时，我们会与执法人员，或其他第三方共享用户个人数据来防止人身伤害或财务损失，涉嫌非法活动或用户协议违反调查等。</div>
    <div class="agm__section">我司要求所有第三方尊重用户个人数据，并根据隐私政策和适用法律对其进行处理。</div>
    <div class="agm__section">退出选择权利</div>
    <div class="agm__section">用户可选择不与第三方共享个人数据，或允许我们将个人数据用于基本收集或需获得用户授权的任何活动。如用户选择，提前告知我司界面或服务的某些功能可能无法使用。</div>
    <div class="agm__section">Cookies</div>
    <div class="agm__section">用户可将浏览器设置为拒绝所有或部分浏览器Cookie，或在网站设置或访问Cookie时设置提醒。如禁用或拒绝cookie，部分功能可能无法访问或无法正常运行。</div>
    <div class="agm__section">目的改变</div>
    <div class="agm__section">除其他原因，用户个人数据用于收集。如需获得有关新的处理及兼容说明，欢迎与我们联系。</div>
    <div class="agm__section">如有其他使用目的，用户将接收到通知，通知内附有详细的法律依据。</div>
    <div class="agm__section">在法律允许的情况下，在某些特定情况下我司会在未告知或未经同意的情况下处理您的个人数据，并遵守上述规则。</div>
    <div class="agm__section">数据安全</div>
    <div class="agm__section">我司将采取适当的安全措施防止个人数据会因未经授权的方式意外丢失，使用或更改。此外，我司严格限制因业务需要的代理方，咨询方对个人数据的访问权限。</div>
    <div class="agm__section">出现任何可疑的个人数据泄露事件均已制定解决方案，我司将通知用户并对相应的违规者发出警告。</div>
    <div class="agm__section">数据保留</div>
    <div class="agm__section">为满足相关法律法规，税务报告要示，我司将在合理时间内保留用户个人数据。如出现投诉或诉讼情况，我司则会在较长时间内保留用户的个人数据。</div>
    <div class="agm__section">为确定个人数据的适当保留期，我司会通过个人数据的使用数量，敏感性，由于未经授权使用可能造成的风险来处理您的个人数据并通过其他相关的法律，法规来评测决定。</div>
    <div class="agm__section">•用于营销目的的个人联系方式信息（如姓名，电子邮件地址和电话号码）会一直保留，直到用户取消订阅为止。</div>
    <div class="agm__section">•如因审计或犯罪预防需要，用户关闭帐户后，发布在我司服务界面上的内容可能会无限期保留。</div>
    <div class="agm__section">用户权益</div>
    <div class="agm__section">用户拥有与个人数据相关的数据保护法的权利，其中包括以下权利：</div>
    <div class="agm__section">•用户个人数据请求访问（通常称为“数据主体访问请求”）：用户能够收到我司持有有关用户个人数据的副本，并监督我司是否合法使用;</div>
    <div class="agm__section">•用户个人数据更新：如有任何不完整或不准确的数据需要更新，请验证信息准备性后再提供；</div>
    <div class="agm__section">
      •用户个人信息删除请求权：用户有权在没有充分理由的情况下要求我司处理或删除个人数据。出于特定法规原因（如，为遵守相关法律在特定时间段内保留个人数据的需要），我司可能无法始终遵守您的删除请求。如有特别情况，我司会在用户提出要求时实时通知;
    </div>
    <div class="agm__section">•反对权：如存在影响个人数据基本权利和自由的情况，用户有权反对我司以营销为目的的情况处理用户的个人数据。</div>
    <div class="agm__section">•处理用户信息限制权：用户将可在以下情况要求我司暂停处理个人数据：</div>
    <div class="agm__section">- 对建立数据的准确性的要求</div>
    <div class="agm__section">-数据不合法使用，但用户不希望删除。</div>
    <div class="agm__section">- 用户用来建立、行使、辩护、索赔，用户可要求我司继续进行数据留存。</div>
    <div class="agm__section">•用户仅可要求将个人数据传输给本人。我司将以常用格式向用户提供其个人数据。此权利仅适用于用户同意或因此需求签订的合同;</div>
    <div class="agm__section">•任何时候的同意使用撤回权：一旦用户撤销同意则不会影响撤销同意之前任何处理的合法性。如用户同意撤销，我司可能无法提供某些特定服务。</div>
    <div class="agm__section">以上权利非绝对性，以下情况访问可能会被拒绝：</div>
    <div class="agm__section">•法律要求或授权拒绝访问;</div>
    <div class="agm__section">•授予访问权限会对他人的隐私产生负面影响;</div>
    <div class="agm__section">•保护我司权利和财产;</div>
    <div class="agm__section">•请求无效或无理由请求。</div>
    <div class="agm__section">
      如需行使上述任何权利，请与我们联系。我司将需要索取具体信息，以确认身份并确保用户有权访问数据，其次，提供更多相关以加快我司回复。期间无费用支付要求即可访问。如用户请求无根据，我司将合理收取费用或拒绝要求。
    </div>
    <div class="agm__section">所有合法请求我司会在30天内回复。</div>
    <div class="agm__section">相关解释</div>
    <div class="agm__section">合法基础</div>
    <div class="agm__section">合法权益表示为用户提供最好的服务/产品以及最佳和最安全的体验，我司业务开展及管理权益。如用户利益受影响我司不会将个人数据用于相关活动（除非征得同意）。
      协议履行是指在用户作为另一方合同所必需的情况下，或本协议签订之前根据用户要求所做的指令。遵守法律义务表示必要时对于用户个人信息的处理，以履行双方共应遵守的法律。您有权随时向信息数据保护部门（“法院”）提出申诉。但我们希望在发生任何相关情况前能与您先做内部沟通处理。
    </div>
    <div class="agm__section">对本隐私政策如有任何疑问，请通过CS@Bgain.com与我们联系。</div>
  </div>
</template>

<script>
export default {
  name: 'Privacy',
};
</script>

<style scoped>

</style>
