<template>
  <div class="agm__container">
    <div class="agm__section">服务标准与条款</div>
    <div class="agm__section">引言</div>
    <div class="agm__section">1.1以下标准和条款（“条件”）仅适用于访问及使用服务（定义如下）（“用户”或“您”）以及提供以下服务的每位个人用户。</div>
    <div class="agm__section">1.1.1数字货币资产的管理通过Finbee Holding Ltd.（Authorisation
      Code:152471890607）提供的平台，该公司在Cayman Islands注册成立，拥有并经营Bgain平台。
    </div>
    <div class="agm__section">1.2我方通过www.bgain.com，以及Bgain所属的移动应用程序或与Bgain相关的界面提供服务。</div>
    <div class="agm__section">
      1.3用户确认，，在接受本服务之前，本人已充分阅读、理解并接受本协议的全部内容，一旦用户通过勾选“同意”选框或点击“同意”按钮的形式签署本协议和/或使用本服务，即意味着用户本人已充分理解本协议所有条款的含义及相应的法律后果，同意与本协议相对方以数据电文形式订立本协议并接受本协议约束。如果您不同意受本条款的约束，请勿访问或使用本服务。
    </div>
    <div class="agm__section">
      1.4根据法律法规变化及本服务运营需要，Bgain有权对本协议条款及相关规则进行不定期修改，修改后的内容一旦以任何形式公布在本软件上即生效，并取代此前相关内容，您应不定期关注本软件公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本软件；如您继续使用本软件，即视为知悉变动内容并同意接受。
    </div>
    <div class="agm__section">
      1.5本服务不提供区域：美利坚合众国，白俄罗斯，古巴，厄立特里亚，伊朗，朝鲜，叙利亚和委内瑞拉（均为“管辖区”）或制裁名单上的任何公民或国民和个人使用（统称为“禁止使用者”）。任何禁止用户访问接口和/或服务必须立即停止使用服务
    </div>
    <div class="agm__section">
      1.6使用本服务之前，用户必须了解其所在国家/地区适用的与本服务相关的法律。用户必须遵守相关法律，如所在地区不允许使用本服务，建议用户立即离开服务界面。如果用户对其管辖范围内的法规有任何疑问，应在使用服务之前咨询其辖区内的相关机构。
    </div>
    <div class="agm__section">
      1.7我司无法对任何国家/地区就当地法律在服务方面提供建议，也不对用户作出任何法律后果保证。因此，通过使用本服务，任何用户使用而导致的任何法律后果或损害皆由用户承担。
    </div>
    <div class="agm__section">2.定义及解释</div>
    <div class="agm__section">2.1在本协议中，除文中另有所指外，下列词语或表达分别具有以下涵义：</div>
    <div class="agm__section">“关联公司”指本公司的附属公司或控股集团或该控股集团的任何其他附属公司;</div>
    <div class="agm__section">“附加条款”具有第3.2条的含义;</div>
    <div class="agm__section">“反洗钱法”是指适用于双方的所有法律，禁止洗钱或任何企图隐瞒或掩饰身份来源，任何形式移动，转让，运输的非法收益，资金或财产;</div>
    <div class="agm__section">“反贿赂法”是指适用于双方的法律，禁止贿赂政府官员，或回扣，诱导及其他形式的腐败或贿赂;</div>
    <div class="agm__section">“适用法律”是指适用于双方的所有法律;</div>
    <div class="agm__section">“内容”具有第18条赋予的含义;</div>
    <div class="agm__section">
      “控制”是指持有或拥有任何（无论直接还是间接）股票或其他证券的实际权益或能够行使对其持有人总量超过50％的投票权。在该司股东大会上可行使的总投票权。“受控”也据此解释;
    </div>
    <div class="agm__section">“CRS”指通用标准或《金融账户涉税信息自动交换标准》;</div>
    <div class="agm__section">“反恐怖融资法”指所有反恐融资法;</div>
    <div class="agm__section">“数字货币资产”指加密货币，代币或其他数字货币资产;</div>
    <div class="agm__section">“争议”具有第32.2条所赋含义;</div>
    <div class="agm__section">
      “抵押”指任何抵押，转让，留置，质押，所有权收购，担保，期权，或其他同类权利，优先购买权，限制权，第三方权利或具有类似效力的任何其他产权，担保权益或任何其他类型的特惠协定（包括但不限于所有权转让或保留），或上述任何内容关联的协议，义务;
    </div>
    <div class="agm__section">“违约”指第13.2条所赋含义;</div>
    <div class="agm__section">“FATCA”指“外国账户税务合规法案”;</div>
    <div class="agm__section">“收费”指用户就服务向本司所支付的交易费用明细;</div>
    <div class="agm__section">“法定货币”是指任何政府视为法定货币的任何货币，“法定货币”解释由此得来;
      “不可抗力事件”是指超出受影响双方合理控制范围的所有可预见或未预见的原因，包括但不限于（a）黑客攻击，或恶意软件的入侵或爆发，以致计算机系统或任何硬件或与服务运行相关的软件损坏，无法正常运行;
      （b）电力，互联网连接，电话或其他通讯系统或电子设备的中断; （c）罢工，火灾，洪水等; （d）任何适用或相关国际组织或政府机关的规定;
    </div>
    <div class="agm__section">“受赔偿双方”指第14条所赋含义;</div>
    <div class="agm__section">“受赔偿方”指第14条所赋含义;</div>
    <div class="agm__section">“破产事件”指第13.2.7条所赋含义;</div>
    <div class="agm__section">“KYC审核过程”指第4.1条所赋含义;</div>
    <div class="agm__section">“法律免责声明”指本司的法律免责声明，Bgain法律免责声明中所述，为本协议的一部分;</div>
    <div class="agm__section">“损失”具有第14条规定的含义;</div>
    <div class="agm__section">“通知”具有第22.1条所赋含义;</div>
    <div class="agm__section">“许可用途”具有第17.1条所赋含义;</div>
    <div class="agm__section">“政策”具有第3.1条所赋含义;</div>
    <div class="agm__section">“禁止管辖”具有第1.5条规定的含义;</div>
    <div class="agm__section">“禁止使用”具有第9.2条赋予的含义;</div>
    <div class="agm__section">“禁止使用者”具有第1.5条规定的含义;</div>
    <div class="agm__section">“隐私政策”指本司不定期修订的隐私政策;</div>
    <div class="agm__section">“制裁”是指任何制裁管理的经济制裁法律，法规，禁运或限制措施，根据2010年发布的《伊朗全面制裁、责任追究和撤资法》和“伊朗制裁法”或任何制裁当局施加的任何同等制裁或措施。
    </div>
    <div class="agm__section">“制裁当局”是指：</div>
    <div class="agm__section">（i）美国或美财政部（“OFAC”）海外资产控制办公室;</div>
    <div class="agm__section">（ii）英国，欧盟或欧盟的任何成员国;</div>
    <div class="agm__section">（iii）联合国（包括其任何有关组织）;</div>
    <div class="agm__section">（iv）日本或日本的财政部;</div>
    <div class="agm__section">（v）新加坡或新加坡金融监管局;</div>
    <div class="agm__section">（vi）适用于双方的任何司法管辖机关。</div>
    <div class="agm__section">“制裁法”是指与制裁或制裁名单相关的法律条款;</div>
    <div class="agm__section">“制裁名单”是指OFAC特别指定的国民和被限制的人员名单，或由任何制裁当局公布制裁指定的任何类似名单;</div>
    <div class="agm__section">“服务”具有第1.1条规定的含义;</div>
    <div class="agm__section">“附属公司”指该企业直接或间接控制的任何其他实体公司;</div>
    <div class="agm__section">“制裁目标”具有第16.1.11条规定的含义;</div>
    <div class="agm__section">“税收”是指任何税收，征税，关税或其他类似的扣缴或扣缴（包括任何相关的罚款）;</div>
    <div class="agm__section">“第三方数据”具有第17.3条所赋含义;</div>
    <div class="agm__section">“用户代表和保证”具有第16.1条所赋含义;</div>
    <div class="agm__section">“变更”具有第1.4条所赋含义。</div>
    <div class="agm__section">2.2除非另有所指，文中所提到的词语均包括单复数，特定性别所指包括男性，女性或中性。</div>
    <div class="agm__section">2.3本条款中的标题仅为方便起见，不影响本协议的构成。</div>
    <div class="agm__section">2.4根据本协议，为避免事项或义务要履行的日期不是工作日，规定的日期内完成的任何事项或义务，应在下一个工作日完成。</div>
    <div class="agm__section">2.5对本协议的引用包括条款修订或补充条款。条款的引用是指本协议的条款。</div>
    <div class="agm__section">3.其他</div>
    <div class="agm__section">3.1用户确认已阅读，理解并同意以下条件，本司可自行决定随时修改，并在服务界面上向用户提供，部分条款为：</div>
    <div class="agm__section">3.1.1免责声明;</div>
    <div class="agm__section">3.1.2费用;</div>
    <div class="agm__section">3.1.3隐私政策和Cookie政策;</div>
    <div class="agm__section">3.1.4推荐计划条款和条件;</div>
    <div class="agm__section">3.1.5市场规定和条款;以及</div>
    <div class="agm__section">3.1.6所有其他相关条款。</div>
    <div class="agm__section">（统称为“政策”）</div>
    <div class="agm__section">
      3.2除了政策之外，服务界面或服务的特定使用可能受附加条款和条件（“附加条款”）的约束，这些条款和条件将完全适用于本协议所提到的附加条款。继续访问和使用界面和服务，即表示您同意此类附加条款。
    </div>
    <div class="agm__section">3.3如本条款和政策条款之间存在任何冲突或不一致，则对这些条件的后续修订的附加协议优先于本协议条款。</div>
    <div class="agm__section">4.帐户设置</div>
    <div class="agm__section">
      4.1为使用服务，用户需要在服务界面上注册帐户。我司可要求用户向本服务及相关第三方提供所需的标准信息，表明用户未违反或有违反反洗钱法，反贿赂法，制裁法，信托基金法及其他法律的风险。在注册过程中，用户可能需要提交信息和文件，以便核实用户身份，以防止欺诈，洗钱和资助恐怖主义，或任何其他金融犯罪（
      “KYC审核”）。我司可向第三方服务供应商提供KYC审核流程的协助，而用户不可撤销地授予本司与第三方服务提供商分享此类信息的权利。用户必须及时提供满足此类调查要求所需的任何信息，包括但不限于允许根据FATCA，CRS和其他适用法律确定税务居住和身份证明。
    </div>
    <div class="agm__section">
      4.2我司将会定期监督和评估可能构成潜在违反反洗钱法，反恐怖融资法，制裁法，反贿赂法和其他适用法律的活动。除KYC审核流程外，用户必须持续提供进一步的信息和文件，或按照本条款的要求，或其任何指定的第三方的要求开展活动。
    </div>
    <div class="agm__section">4.3根据所收集到的用户信息，我司可全权决定帐户设置服务中的拒绝，终止或暂停以及用户访问界面或限制用户可持有的帐户数量，用户对一项或多项服务的访问权限。</div>
    <div class="agm__section">4.4通过服务界面上用户对账户的设置操作，表示用户同意向我司及关联公司和第三方服务提供商提供个人数据和其他信息。有关用户个人数据处理的更多详细信息，请参阅我司的隐私政策。
    </div>
    <div class="agm__section">5.服务范围</div>
    <div class="agm__section">5.1服务的使用界定取决于用户在服务界面上设置帐户，在符合标准和满足账户设置条件下，则允许用户访问以下服务，包括：</div>
    <div class="agm__section">5.1.2提供数字货币资产委托管理平台的访问。</div>
    <div class="agm__section">
      5.1.2通过提供专业的数字资产组合产品，采取科学有效的数字资产配置方式，帮助各层次的投资者进入数字资产领域，妥善管理好各种数字资产，包括但不限于产品信息发布服务、交易资料传递服务、交易指令传递服务、交易记录管理服务和交易协议签署辅助服务等。
    </div>
    <div class="agm__section">5.2我司保留服务范围更改和规定的权利，并可自行决定暂停或终止任何服务，恕不对用记作另行通知。</div>
    <div class="agm__section">5.3我司在界面交易实现的交易中所担任并非代理人角色。但在部分服务中，我司有权管理和执行服务界面活动中各方之间的合同。</div>
    <div class="agm__section">6.信息泄露</div>
    <div class="agm__section">6.1用户需保证并承诺向我司提供的所有信息均为真实，完整，准确，最新且无任何重大误导。</div>
    <div class="agm__section">6.2用户负责维护和更新所有此类信息，以便保持真实，完整，准确，最新且无误导性。用户同意通知我司在提供服务的过程中向我司提供任何相关信息变更。</div>
    <div class="agm__section">
      6.3用户不可撤销地承诺在需要时及时向我司提供可能不时要求的任何信息和（或）文件。用户特此明确且不可撤销地允许和授权我司及其员工和（或）本集团授权的任何其他人员根据任何KYC流程提供用户提供的任何文件的任何信息和副本。
    </div>
    <div class="agm__section">6.4用户应遵守我司定期要求的客户调查及其他反洗钱要求信息。</div>
    <div class="agm__section">7.账户安全</div>
    <div class="agm__section">7.1用户应妥善保管其账户安全信息，对其使用的账户下发生的所有活动承担全部责任，包括提交给我司的所有信息，无论是在服务界面上的公开发布或私下传输。</div>
    <div class="agm__section">
      7.2用户应：（a）立即通知我司任何未经授权使用密码，帐户名称或任何其他违反安全规定的行为，以及（b）确保在每次访问结束后迅速退出帐户。我司对因未遵守本协议第8条而引起的任何损失或损害概不负责。
    </div>
    <div class="agm__section">8.禁止使用</div>
    <div class="agm__section">8.1用户将禁止以下行为：</div>
    <div class="agm__section">8.1.1使用界面或服务来掩饰非法收益的来源或性质，或进行任何非法数字货币资产或收益的交易;</div>
    <div class="agm__section">8.1.2禁止滥用界面或服务，包括但不限于反洗钱法，反恐怖融资法，反贿赂法，制裁法，或向任何具有法律风险的机构使用本服务;</div>
    <div class="agm__section">8.1.3禁止使用本界面服务来规避任何相关法律，包括但不限于反洗钱法，反恐怖融资法，反贿赂法和制裁法;</div>
    <div class="agm__section">8.1.4禁止使用界面服务逃避与用户相关的任何司法税收;</div>
    <div class="agm__section">8.1.5禁止在界面上进行交易或使用，除了法定货币，数字货币资产，基金，密匙或财产以外的内容，包涵用户合法获得和所属;</div>
    <div class="agm__section">8.1.6使用接口或服务干扰或破坏我司的权利或义务或任何其他接口用户或任何其他第三方的权利或义务;</div>
    <div class="agm__section">8.1.7禁止使用具有误导性或不准确信息进行交易，或利用任何技术故障，延迟，违约或钻安全漏洞;</div>
    <div class="agm__section">8.1.8在使用服务时，禁止从事对我司或任何其他用户或第三方有害的行为;</div>
    <div class="agm__section">8.1.9禁止向我司提供任何伪造账户注册，交易或管理细节;</div>
    <div class="agm__section">8.1.10注册时或在向用户提供任何服务的过程中，禁止向本平台提供任何具有误导性或不准确的信息;</div>
    <div class="agm__section">8.1.11禁止对本界面运行任何软件进行逆向，反编或汇编行为;</div>
    <div class="agm__section">8.1.12禁止通过访问做出任何对本平台或第三方造成伤害或企图伤害的行为;</div>
    <div class="agm__section">
      8.1.14禁止用户在接受本条款规定的禁止或限制条件外，访问界面时使用任何虚拟专用网络，代理服务或其他第三方服务，网络或任何服务，以掩盖用户的真实身份，IP地址或位置，或在禁止管辖区使用本服务;
    </div>
    <div class="agm__section">8.1.15具有违反，共谋或企图违反本协议条款或相关法律。</div>
    <div class="agm__section">8.2 如第8.1条所述的任何使用均构成“禁止使用”。如本平台确定用户已从事任何
      “禁止使用“行为，则我司可以全权决定通过适当的制裁处理此类不当使用。制裁可能包括但不限于向任何政府，执法机构或其他机构提交报告，而不向用户提供任何通知，可直接暂停或终止用户对平台服务的访问权限。为遵守相关法律或任何其他司法管辖区的法律，我司有权采取适当行动。此外，如果用户的行为或不作为导致任何经济成本，则用户应向我司支付一定金额，来支付可能出现的（包括但不限于）税额或惩罚金额。
    </div>
    <div class="agm__section">9.本平台权利</div>
    <div class="agm__section">
      9.1我司保留随时决定修改或暂时或永久终止服务（包括传输任何相关材料或文件）的权利。我司将进一步保留随时更改，服务或功能终止的权利，恕不另行通知。对于平台界面上提供的服务，内容或功能的任何修改，暂停或终止，我司将不对用户或任何第三方承担任何责任。
    </div>
    <div class="agm__section">
      9.2我司保留根据任何未决交易的权利，包括自行决定，法律要求，法院命令或其他有约束力的政府命令或交易限制。我司无法撤销向数字货币平台已公布的交易。我司支持的数字货币资产可能会不时变更，该服务仅适用于我司自行决定支持的数字货币资产。对本平台不支持的数字货币资产服务我司不承担任何责任。
    </div>
    <div class="agm__section">
      9.3本平台提供的服务可能会遇到技术或其他限制，系统可能会遇到中断，我司将不断增强和改进系统服务，此外，在服务界面中可能需要开发其他技术的特性和功能，通过处理系统或提供新功能提高服务或平台的利用率或增加交易量可能会导致意外的系统中断，平台响应时间慢，客户服务以及报告延迟，在此情况下我方对任何损失均不承担责任。
    </div>
    <div class="agm__section">9.4由于需要，本平台需要从离线存储中检索信息，以便服务执行交易，用户通过并同意促成的交易可能会延迟。</div>
    <div class="agm__section">9.5我方保留自行决定对用户施加交易限制的权利。</div>
    <div class="agm__section">10 服务费用</div>
    <div class="agm__section">10.1用户确知并同意，我司有权向用户收取服务费。各项服务费用包括但不限于：</div>
    <div class="agm__section">（ⅰ）管理费。用户在本平台交易需要支付管理费；</div>
    <div class="agm__section">（ⅱ）手续费。用户在本平台卖出卖出需要支付卖出手续费；</div>
    <div class="agm__section">（ⅲ）矿工费。用户在本平台提现数字资产需要支付矿工费。</div>
    <div class="agm__section">我司保留单方面制定及调整服务费用的权利。</div>
    <div class="agm__section">10.2我司可能会对部分免费服务开始收费。前述修改、变更或开始收费前，我司将在相应服务页面进行通知或公告。如果用户不同意上述修改、变更或付费内容，则应停止使用该服务。</div>
    <div class="agm__section">11.税务</div>
    <div class="agm__section">用户通过服务进行的所有交易，用户有责任确定是否向税务机关汇报准备的税款。</div>
    <div class="agm__section">12.期限和终止</div>
    <div class="agm__section">12.1本协议的期限自用户接受之日起，并于以下时间终止：</div>
    <div class="agm__section">12.1.1用户和我方以书面形式达成的共同协议终止本协议，</div>
    <div class="agm__section">12.1.2我方单方终止（i）发生违约事件（定义见下文），或（ii）如我方在某些情况下所作出的决定。</div>
    <div class="agm__section">12.2就本协议而言，“违约”是指以下任何一项事件：</div>
    <div class="agm__section">12.2.12用户在履行或遵守本协议中的任何违约（第13.2条所述的除外）和任何违约行为，在3个工作日内违约行为未改正;</div>
    <div class="agm__section">12.2.2用户在本协议中作出的任何陈述或保证，被证实或证明是不真实，不正确或具误导性;</div>
    <div class="agm__section">12.2.3用户暂停或停止继续（或威胁暂停或停止继续）全部或部分服务;</div>
    <div class="agm__section">12.2.4我方认为已经发生或可能产生重大不利影响的任何事件或情况;</div>
    <div class="agm__section">12.2.5用户以任何不利于我方利益的方式进行欺诈或不诚实行为;</div>
    <div class="agm__section">12.2.6出现任何发生在用户身上的破产事件。“破产事件”是指发生下列任何一项事件，但本条款13.2.7不适用于：无任何理由及在生效日起二十一（21）天内自动解除：</div>
    <div class="agm__section">（a）该用户正经历司法流程;</div>
    <div class="agm__section">（b）用户决定自行申请破产或其他方式的破产;</div>
    <div class="agm__section">（c）用户经历财产清盘人员或临时清盘人对其财产的清盘;</div>
    <div class="agm__section">（d）用户委任司法人员对资产进行清盘;</div>
    <div class="agm__section">（e）用户为债权人进行资产转让;</div>
    <div class="agm__section">（f）用户就其资产委任接管人或经理人;</div>
    <div class="agm__section">（g）用户在其法律管辖区发生任何与上述事件相似的事件或造成重大的影响;</div>
    <div class="agm__section">12.2.8任何用户或项目方在履行或遵守本协议前提下，其他相关规定将视为无法律效益。</div>
    <div class="agm__section">12.2.9本协议的重大条款无论因何种原因变为非法，无效或不可执行。</div>
    <div class="agm__section">12.3上述终止不应损害本集团对任何先前违反本条款条款的权利，也不影响救助条款或本条件中任何其他条款的有效性，持续性或有效性。为了生存这样的终止。</div>
    <div class="agm__section">12.4在发现违约事件后，用户应立即通知我方采取措施予以纠正。根据需求，应立即向我方提供由其两名董事或高层管理人员代表签署的证明，证明不存在违约事件。</div>
    <div class="agm__section">13.赔偿</div>
    <div class="agm__section">用户由以下方式，或以任何方式涉及或以下原因引起并对我司造成损失：</div>
    <div class="agm__section">（a）用户提供的信息;</div>
    <div class="agm__section">（b）违反用户的义务，承诺，陈述和保证，本协议的规定，或用户就服务达成任何协议的规定;</div>
    <div class="agm__section">（c）用户违反或不遵守任何相关法律以及法规。</div>
    <div class="agm__section">
      用户承诺对我司（统称为“被赔偿方”）进行全面赔偿使其免受损害，包括但不限于任何时间或不定期的所有损失，索赔，诉讼，判决，应付款项，债务，损害赔偿，费用和开支（包括合理的律师费和支出） ）和任何可能产生的费用（统称为“损失”）。
    </div>
    <div class="agm__section">14.免责</div>
    <div class="agm__section">
      由于用户造成的包括任何直接，间接，特殊，后果性，惩罚性，偶然性损失或损害（无论是侵权行为，合同或其他），我方（在法律允许的最大范围内）在任何情况下均不对任何损失或损害承担责任，包括但不限于：
    </div>
    <div class="agm__section">（a）我方平台向用户提供服务，包括用户因使用服务而导致的任何投资损失;</div>
    <div class="agm__section">（b）服务界面的正确使用;</div>
    <div class="agm__section">（c）任何第三方或第三方网站上可以访问的链接和信息;</div>
    <div class="agm__section">（d）用户根据服务制定的任何协议的内容使用，以我方提供的原始形式，或已协商和商定的形式，包括与此类协议有关的第三方间出现的任何争议;</div>
    <div class="agm__section">（e）就用户根据服务订立的任何协议而言，出现第三方行为;</div>
    <div class="agm__section">（f）直接或间接产生的利润，商业机会，收入，营业额，声誉或商誉上的任何损失;</div>
    <div class="agm__section">（g）数据丢失或损坏;</div>
    <div class="agm__section">（h）任何局域网的损坏或中断;</div>
    <div class="agm__section">（i）病毒，蠕虫或其他破坏性程序造成的商业或经济损失;</div>
    <div class="agm__section">（j）服务期间由于任何一方（或界面内容）作出的任何改动;</div>
    <div class="agm__section">（k）因使用服务而导致任何数据传输，延迟，故障中断或损坏；</div>
    <div class="agm__section">（l）出现与服务和界面内容有关的任何不准确，错误或遗漏。</div>
    <div class="agm__section">15.陈述和保证</div>
    <div class="agm__section">15.1用户向我方作出以下陈述和保证：</div>
    <div class="agm__section">15.1.1完成申请注册，成为平台界面的用户，经过用户的正式授权，完成与互动界面使用相关的所有事情;</div>
    <div class="agm__section">15.1.2用户保证为访问和服务使用而提供的任何信息，是真实，完整，准确，没有误导性的，并且无任何重大事实的遗漏，任何遗漏都将导致误导性;</div>
    <div class="agm__section">15.1.3用户年满18周岁（或者在所属国家管辖范围内已达到法定成人年龄），具有完全签订此类合同的能力（包括在服务界面上进行交易），此条款有效并对用户强制执行;</div>
    <div class="agm__section">15.1.4用户理解与使用接口和服务相关的风险，并非被禁止的用户或适用法律禁止使用服务;</div>
    <div class="agm__section">15.1.5用户通过登录凭证或在我方授权电子邮件地址收到或进行的任何交易或其他指示均被视为有效，具有约束力，且我方可根据这些指示行事，说明书不附带任何责任或义务;</div>
    <div class="agm__section">
      15.1.6用户不得使用界面服务来隐瞒或掩饰非法或可能导致或进一步违反相关法律（包括反洗钱法或反恐怖融资法）或进行交易的收益来源或性质属于任何非法数字货币资产，非法法定货币，财产，资金或收益;
    </div>
    <div class="agm__section">15.1.7用户不得使用数字货币资产以外的任何东西进行交易或使用我方任何服务;</div>
    <div class="agm__section">15.1.8用户支配的费用符合与本协议服务有关的所有相关法律，包括但不限于反洗钱法，反恐怖融资法，反贿赂法，制裁法或税法，包括“外国账户税务合规法案”，
      “金融账户涉税信息自动交换标准”
    </div>
    <div class="agm__section">15.1.9用户遵守反洗钱法，反恐怖融资法，反贿赂法，制裁法或税法（包括“外国账户税务合规法案”和“金融账户涉税信息自动交换标准”）的任何及所有税务法规;</div>
    <div class="agm__section">15.1.10用户或其关联公司均不可直接或间接向违反相关反贿赂法律的私营部门政府官员或个人提供其他任何有价值的东西，包括任何数字货币资产，;</div>
    <div class="agm__section">15.1.11任何用户如果：</div>
    <div class="agm__section">（a）目前处于：</div>
    <div class="agm__section">（i）受制裁或出现在任何制裁名单上;</div>
    <div class="agm__section">（ii）根据当地法律，个人所在地区处于地域广泛制裁区域;</div>
    <div class="agm__section">（iii）或是被制裁目标（“制裁的目标”：法律禁止或限制美国人或其他公民或制裁当局的国民从事贸易，商业或其他活动的人） ;</div>
    <div class="agm__section">（b）已接获任何制裁当局的制裁通知或知悉有关制裁的任何诉讼，申诉程序或调查;</div>
    <div class="agm__section">（c）代表任何制裁名单上的任何人或受禁止管辖权管辖的任何个人；</div>
    <div class="agm__section">不得为任何制裁当事人或受禁止管辖区管辖的任何人的活动提供资金;</div>
    <div class="agm__section">15.1.13用户应：</div>
    <div class="agm__section">（a）遵守所有税务规定;</div>
    <div class="agm__section">（b）用户无刑事诉讼纠纷;</div>
    <div class="agm__section">（c）遵守所有相关法律，包括反洗钱法，反恐怖融资法，反贿赂法，制裁法，就业法，或政府机构发布的规则授权，其业务正在合法运作，用户所在区域合法并已获取运营所需所有合法权限。
    </div>
    <div class="agm__section">15.1.16接受条款，履行本协议义务，用户所有交易不得：</div>
    <div class="agm__section">（d）违反法律，或相关的法律文件;</div>
    <div class="agm__section">（e）对任何指示，文书，合同，文件或协议构成侵权或违约;</div>
    <div class="agm__section">（f）违反任何法律法规，或对任何法定机构或监管未履行承诺。</div>
    <div class="agm__section">（以下统称为“用户保证”）</div>
    <div class="agm__section">15.2用户向我方证用户保证内容真实准确，并且始终完全遵守提及在所有条款。</div>
    <div class="agm__section">15.3我方不对用户作出任何保证。界面服务严格按原始规划提供，并在不限制前述内容为一般性的情况下，不提供任何特定陈述。</div>
    <div class="agm__section">16.保密</div>
    <div class="agm__section">16.1根据我方的隐私政策，用户允许和授权我方提供所有相关信息。除非用户明确指示，我方将根据本协议对信息标记为“机密”。</div>
    <div class="agm__section">16.2第17.1条规定的保密协议不适用于：</div>
    <div class="agm__section">16.2.1公众普遍知晓的信息，除非因我方或其他任何代表故意透露的行为;</div>
    <div class="agm__section">16.2.2根据相关法律要求公开的任何信息，或根据任何相关监管监督机构的规则或条例（包括但不限于任何相关的证券交易所或证券委员会）;</div>
    <div class="agm__section">16.2.3根据任何法院或法律程序要求所披露的信息；</div>
    <div class="agm__section">16.2.4与本协议相关的银行，财务顾问，法律顾问或其他顾问公开发布的任何信息。</div>
    <div class="agm__section">16.3为获取第三方数据，用户确认并同意可以不定期向我方提供的第三方信息。因此，用户同意并向我方承诺，已获得必要同意，或在信息公开时，供我方平台收集。</div>
    <div class="agm__section">16.4本协议第17条规定的义务即使在任何缔约方解除或根据本协议规定允许的情况下终止本协议，也应当不受任何限制，除非机密信息公开。</div>
    <div class="agm__section">17.许可</div>
    <div class="agm__section">
      根据协议，用户被授予有限的，不可转让的许可，相关内容，材料和信息（统称“内容”仅在我方允许批准的目的下使用。禁止对界面服务或内容进行任何其他使用，并且服务中的所有其他权利，所有权和利益仅为我方财产。用户同意不会复制，传输，出售许可，发布或参与转让或销售，创建衍生作品或以任何其他方式利用我方平台内容。“Bgain”，“Bgain.com”以及与服务相关或在服务平台界面上显示的所有标志，名称，设计均为我方或关联公司的商标或注册商标。未经我方事先书面同意，用户不得复制，模仿或使用此类标识或标记。
    </div>
    <div class="agm__section">18.保证</div>
    <div class="agm__section">本着真实的方向，双方同意执行本协议，并有效执行所有条款。</div>
    <div class="agm__section">19.合作伙伴或代理商</div>
    <div class="agm__section">本协议目的不为在任何一方之间建立合伙人或合资企业，或代理人。</div>
    <div class="agm__section">20.用户间争议</div>
    <div class="agm__section">20.1如用户间发生交易纠纷，用户可收集有关争议记录详情，并及时向我方平台报告。我方将要求相关用户提供有关争议的进一步信息和支持证据，此类要求用户将始终遵守。</div>
    <div class="agm__section">20.2当用户之间发生争议时，我方可根据相关法律法规向主要司法机关提供必要的交易数据或其他信息。</div>
    <div class="agm__section">20.3除非用户另有约定或相关法律要求，否则用户应遵循第32条规定条款，以解决因使用服务而引起的任何争议。</div>
    <div class="agm__section">20.4一旦用户之间的争议得到解决或用户已收到最终裁决，相关用户人员应该向我方提供该和解协议，判决证据。</div>
    <div class="agm__section">21.通知</div>
    <div class="agm__section">21.1与本条件有关的任何通知或其他通知应为：（a）以书面形式;及（b）以电子邮件形式。所有通知均应送达该缔约方的地址，并且双方可通过书面通知另一方发出通知的新地址。</div>
    <div class="agm__section">21.2通知应在收到后生效，并视为已经收到：如果通过电子邮件发送，则在收件人的收件箱中收到。</div>
    <div class="agm__section">22.可分割性</div>
    <div class="agm__section">根据相关法律，任何条款的非法性，无效性或不可执行性不影响其司法管辖区的法律的合法性，也不影响任何其他条款的合法性，有效性或可执行性。</div>
    <div class="agm__section">23.无效</div>
    <div class="agm__section">23.1如本协议中的任何条款被认定为非法，无效或不可执行，全部或部分，则该条款将进行必要的删除或修改，以使该协议合法，有效和可执行，并使该协议生效。</div>
    <div class="agm__section">
      23.2根据第23.1条不可能全部或部分删除或修改该协议，则该协议或其中的一部分应在其非法，无效或不可执行的范围内，视为不作为本协议的一部分，在不受第24.1条规定的任何修改的情况下，本条款其余部分的合法性不受影响。
    </div>
    <div class="agm__section">24.合理性</div>
    <div class="agm__section">双方均确认本协议规定的所有事项，并同意（a）不得对本协议中做任何含糊不清的推定，不得因任何一方单方原因对任何一方提出异议，（b）本协议规定和根据本协议制定的所有文件均合法合理。
    </div>
    <div class="agm__section">25.完整协议</div>
    <div class="agm__section">本协议条款的完整协议构成，可（除另有规定外）取代并取消任何先前的书面或口头草案，陈述。</div>
    <div class="agm__section">26.不可抗力</div>
    <div class="agm__section">如因不可抗力事件导致协议失效，延迟或变更，我方不对本协议下履行义务的任何失败，延迟或变更承担责任。</div>
    <div class="agm__section">27.转让</div>
    <div class="agm__section">用户不得转让或转让本协议下的全部或部分权利或义务。</div>
    <div class="agm__section">28.变更</div>
    <div class="agm__section">28.1我方保留随时对本协议的任何条款作出变更的权利，如有变更恕不另行通知，用户受我方变更日期的约束。</div>
    <div class="agm__section">28.2除非明确同意，否则任何变更均不构成对本协议任何条款的豁免，也不影响本协议已经累计的任何权利，义务或责任。本协议双方根据所需履行义务仍然具有完整法律效益。</div>
    <div class="agm__section">29.补救和豁免</div>
    <div class="agm__section">任何一方在本协议下不得延迟行使，任何权利，任何单一或部分行使任何权利或补救措施不得排除其他权利或补救措施。本条款中规定的权利是累积性的，并不排除法律规定的任何权利或补救措施。</div>
    <div class="agm__section">30.无第三方的权利</div>
    <div class="agm__section">本协议中任何条款均不得由非本协议的缔约方执行。</div>
    <div class="agm__section">31.管辖法律和司法管辖权</div>
    <div class="agm__section">31.1本协议适用开曼群岛法律法规，并按其解释。</div>
    <div class="agm__section">31.2双方同意，因本协议而产生的或与本协议有关的一切争议，双方应尽量通过协商解决。经友好协商未能解决的，应提交新加坡国际仲裁中心依当时有效的仲裁规则申请仲裁，仲裁地在新加坡，仲裁裁决是终局性的，对双方具有约束力，除裁决另有规定外，仲裁费由败诉方承担。</div>
    <div class="agm__section">31.3 双方同意，因本协议而产生的或与本协议有关的一切争议，不得通过集体仲裁、集体诉讼或其他任何类型的代表诉讼来解决。在法律允许的最大范围内，委托方不可撤销、无条件地放弃提起或参与任何针对代理方、其关联方或任何被保护人士的集体诉讼、集体仲裁的权利。</div>
    <div class="agm__section">31.4 在法律允许的最大范围内，委托方不可撤销、无条件地放弃对其自身及其任何收入或资产基于所有权或其他类似理由对下列事项的所有豁免：（1）诉讼或仲裁；（2）任何法院或仲裁庭的管辖权；（3）通过强制令或命令对其自身及其任何收入或资产的救济；（4）资产扣押；（5）执行任何司法管辖区的法院的任何诉讼中获得的任何判决或仲裁庭仲裁获得的任何裁决。</div>
  </div>
</template>

<script>
export default {
  name: 'Service',
};
</script>

<style scoped>

</style>
