<template>
  <div class="wrap">
    <div>尊敬的用户:</div>
    <div
      class="line"
    >为了维护您的自身权益、防范数字货币基金的相关风险，请在购买前仔细阅读该风险说明各条款，以充分知悉、了解Bgain数字货币基金购买服务的运作规则及义务。一旦购入Bgain数字货币基金产品即视为您对该风险说明已充分理解并完全接受。</div>
    <div class="line">(一)基金产品服务周期内基金净值会随市场、政策、投资标的等实际情况而波动，投资存在本金亏损的可能。</div>
    <div
      class="line"
    >(二)投资人投资前请根据自身风险承受能力谨慎决策，并自行承担投资风险。基金是一种长期稳健投资工具，其主要功能是分散投资，降低投资单一所带来的个别风险。投资人购买基金，既可能按其持有份额分享基金投资所产生的收益，也可能承担由此投资所带来的损失。</div>
    <div
      class="line"
    >(三)基金在投资运作过程中可能面临各种风险，既包括市场风险，也包括基金自身的管理风险、技术风险和合规风险等，投资人应根据自身的投资目的、投资期限、投资经验、资产状况等判断基金产品的风险级别是否和投资人的风险承受能力相适应。投资人认购超出其风险承受能力的基金而产生的一切损失及风险均由投资人自行承担。</div>
    <div class="line">(四)巨额赎回风险也是所持有的一种风险，即当单个基金交易开放期内的净赎回申请超过基金总份额的30%时，投资人将可能无法及时赎回持有的全部基金份额。</div>
    <div class="line">(五)购买平台数字货币基金产品，由于数字货币转出需要上链，操作过程不可逆，投资人需注意相关风险。</div>
    <div class="line">(六)每一只基金在发售时，平台均会发布《风险说明》，请您在购买该基金前，仔细阅读基金产品的相关信息或基金的宣传品。</div>
    <div
      class="line"
    >(七)基金管理人承诺以诚信、尽责的原则管理并运用基金资产，但不保证基金一定盈利，也不保证最低收益。基金的历史收益及其净值高低并不代表未来业绩表现。本平台提醒投资人在做出投资决策后，基金运营状况与净值变化引致的投资风险，由投资人自行负担。</div>
    <div class="line">(八)基金交易申请信息最终确认结果（包括但不限于认购、赎回等）以平台最终确认为准。具体确认时间以对应基金产品信息中公布的为准。</div>
    <div
      class="line"
    >(九)投资人对交易密码、平台账号等身份数据负有保密责任，确保交易密码、平台账号等身份数据不泄露或被窃取。如因交易密码、平台账号等身份数据失密、操作不当等原因导致其他人通过交易密码、平台账号等身份数据进行交易或修改投资人资料，均视为投资人本人的有效委托，产生的后果均由投资人自行承担。</div>
    <div
      class="line active"
    >特别说明：上述风险提示仅列举基金投资中存在的部分风险，对于所有基金投资的风险无法一一详述，您需在投资前详细阅读基金的相关协议和其他相关产品信息，对其他可能的影响因素有所意识，并确定做好财务规划和风险评估，以免因为贸然投资而遭受难以承受的损失。</div>
  </div>
</template>

<script>
export default {
  name: 'RiskStatement',
};
</script>

<style lang="scss" scoped>
.wrap {
  font-size: 13px;
  color: #6a707d;
  line-height: 26px;
  padding: 15px 20px 30px;
  .line {
    margin-top: 10px;
  }
  .active {
    margin-top: 20px;
  }
}
</style>
